sunrise-server/app/controllers/sunrise_controller.rb

SELECT "sun_events".* FROM "sun_events" WHERE "sun_events"."location" = 'paris' AND "sun_events"."date_start" = '2025-06-03' AND "sun_events"."date_end" = '2025-11-28' LIMIT 1
---

    begin
      # Use `where` to get a collection of sun_events matching the params
      sun_events = SunEvent.where(location: location, date_start: start_date, date_end: end_date)