sunrise-server/app/services/sun_event_api_service.rb

INSERT INTO "sun_events" ("location", "date_start", "date_end", "sunrise_time", "sunset_time", "golden_hour", "latitude", "longitude", "created_at", "updated_at") VALUES ('Lisbon', '2025-06-02', '2025-06-04', '2025-06-29 06:14:44', '2025-06-29 20:57:16', '2025-06-29 20:18:02', 38.7077507, -9.1365919, '2025-06-29 21:24:56.152395', '2025-06-29 21:24:56.152395') RETURNING "id"
---
  def self.fetch_and_store(location, latitude, longitude, date_start, date_end)
    uri = URI(API_URL)
    uri.query = URI.encode_www_form({
      lat: latitude,
      lng: longitude,
      date_start: date_start,
      date_end: date_end

    })

    response = Net::HTTP.get_response(uri)

    return nil unless response.is_a?(Net::HTTPSuccess)

    json = JSON.parse(response.body)
    return nil unless json["status"] == "OK"

    data = json["results"]

    Rails.logger.info("Fetching sun event data: #{uri}")

    data.each do |event|
      SunEvent.create!(
        location: location,
        date: event["date"],
        date_start: date_start,
        date_end: date_end,
        sunrise: event["sunrise"],
        sunset: event["sunset"],
        golden_hour: event["golden_hour"],
        latitude: latitude,
        longitude: longitude
      )